{
  "id": "69197bbe3ca036ea54c95e81",
  "title": "Before Tech, My First Love was Literature",
  "brief": "While most of my acquaintances would very quickly identify me as a science and technology aficionado, many are quick to overlook the fact that this passion of mine was relatively recently discovered (against the backdrop of my 28 years of living). Be...",
  "slug": "before-tech-my-first-love-was-literature",
  "coverImage": {
    "url": "https://cdn.hashnode.com/res/hashnode/image/upload/v1763275807848/6f41cbe7-fa55-4977-b1b1-5a89fbe0aa61.jpeg"
  },
  "publishedAt": "2025-11-16T07:22:38.247Z",
  "readTimeInMinutes": 9,
  "author": {
    "name": "Natasha Ann",
    "profilePicture": "https://cdn.hashnode.com/res/hashnode/image/upload/v1723888613863/CVbEFXQ8O.png"
  },
  "content": {
    "html": "<p>While most of my acquaintances would very quickly identify me as a science and technology aficionado, many are quick to overlook the fact that this passion of mine was relatively recently discovered (against the backdrop of my 28 years of living). Before I went to the United States and was welcomed into the field of science and technology, I carried a persona that was always associated with a drastically different discipline, one that would almost never have been associated with science and technology back in Singapore - literature and writing.</p>\n<h1 id=\"heading-my-first-love\">My First Love</h1>\n<p><img src=\"https://scontent.fsin13-1.fna.fbcdn.net/v/t39.30808-6/516869601_10162559050868213_6167643404255647118_n.jpg?_nc_cat=100&amp;ccb=1-7&amp;_nc_sid=cf85f3&amp;_nc_ohc=Ckcw50hANwMQ7kNvwGSE_dI&amp;_nc_oc=AdkEHyTsU-qSswsVZmzxybG2qzfm2wTK7ioJuMCjzhlaeKGNR4_IkeO5F0Kt7pEaaOk&amp;_nc_zt=23&amp;_nc_ht=scontent.fsin13-1.fna&amp;_nc_gid=8Yg2Nl7Wkic4lDLF01OpaA&amp;oh=00_AfgZ5O8Y6Fe_vKp5ndOnhivNy3o3plo4CMM0NIoz6isR4Q&amp;oe=691F514E\" alt=\"No photo description available.\" class=\"image--center mx-auto\" /></p>\n<p>Literature and writing was always my first love. As a child, I loved that each and every one of my pocket-sized Enid Blyton books would take me on an exhilarating ride into a new world, offering me an exciting variety of fictional companions and landscapes that I could recreate in the fantastical space that was a child's imagination. I would have exercise books and coloring pencils and markers strewn all over my bedroom floor as I penned (or in this case, penciled and markered) my own stories, complete with arguably accurate illustrations of my characters.</p>\n<h2 id=\"heading-a-refuge\">A Refuge</h2>\n<p><img src=\"https://scontent.fsin13-1.fna.fbcdn.net/v/t39.30808-6/517409104_10162559050873213_4843897632190733910_n.jpg?_nc_cat=107&amp;ccb=1-7&amp;_nc_sid=cf85f3&amp;_nc_ohc=1AemxhscxasQ7kNvwFYn1a2&amp;_nc_oc=Adk4m72nRR7wKNf0Y4IMPFH8ahNFBYeTuZ9wpw_7_eHyjqvz4j9b8PZsSrbgBzRGf1k&amp;_nc_zt=23&amp;_nc_ht=scontent.fsin13-1.fna&amp;_nc_gid=W9jcimUPZluCYdAfM5iJBw&amp;oh=00_AfhGwy6OBWSonfvymjqpB6oOtRnv6VAwDoJsnZhK4GYFiA&amp;oe=691F5F2E\" alt=\"No photo description available.\" class=\"image--center mx-auto\" /></p>\n<p>Reading and writing gave me refuge from difficult times at home when my parents were still going through a rough patch (they are great now! Just acknowledging that raising children can create lots of tension in families). In fact, it gave me more than just refuge - it gave me the courage to express my thoughts when I felt disempowered to express them verbally.</p>\n<p>I remember waking up to a fight between my parents on a Saturday morning. Despite being behind closed doors, the hollow walls and chipwood doors hardly offered a disguise for the ugliness that was happening behind them. I would cower in the corner or my bed, fearful and confused, regardless of the numerous episodes of this nightmarish podcast I had already sat through.</p>\n<p>This time, however, the podcast was at its climax.</p>\n<p>I heard a muffled, threatening shout, followed by a shrill scream. There was a brief silence, and then a frightening thud on the door - the shattering of ceramic echoed through the confines of our small apartment. I darted out of my bed and dashed for the door, nimbly tiptoeing past the shattered ceramic pieces that were once a pristine dove ornament, now scattered in front of my parents' bedroom. Pressing my ears against the door, I listened attentively for a sign that my parents were not hurt, and was relieved to hear them continue in their angered row.</p>\n<h2 id=\"heading-when-my-voice-didnt-help-words-did\">When My Voice Didn’t Help, Words Did</h2>\n<p><img src=\"https://scontent.fsin13-1.fna.fbcdn.net/v/t39.30808-6/517438852_10162559050828213_2320198346537234694_n.jpg?_nc_cat=102&amp;ccb=1-7&amp;_nc_sid=cf85f3&amp;_nc_ohc=Kvp6gz20EtoQ7kNvwGNSFFB&amp;_nc_oc=AdnxSOcwCBYBsljmRGGOIrNX9IYxXhZ1yBbUxg4eUGxjiwlbEO7-9N_m-4GQGfR183g&amp;_nc_zt=23&amp;_nc_ht=scontent.fsin13-1.fna&amp;_nc_gid=c-ek409VAcbEQTtY2WSqmA&amp;oh=00_Afius5mJt_Zx9ljv_t7bqtnmS6dEDboMRU_SorYTvhugrw&amp;oe=691F474C\" alt=\"No photo description available.\" class=\"image--center mx-auto\" /></p>\n<p>That was the point that I decided that I needed to end this traumatic series of arguments. I clenched my jaw and tightened my throat, looking for the strength and the words to convey my words over their bickering.</p>\n<p>No words came, not even a croak.</p>\n<p>Out of the corner of my eye, however, I noticed one of my purple markers lying by a ceramic piece. Intuition took hold - I grabbed the marker with one hand and gently cradled the ceramic piece in the other, slowly scribbling down my message with the best words that existed within my limited lexicon.</p>\n<p>“Please stop quareling, it makes me upset.”</p>\n<p>I pursed my lips, wondering if I had spelt quarreling right. I assumed I did. I cautiously slid the piece through the door and hoped my parents would notice.</p>\n<p>And they did. Almost immediately, there was a hushed silence and then a hurried pitter-patter of footsteps toward the door. I scrambled up to my feet and creeped hurriedly back into my bed, straining my ears to listen out for what would ensue. There was a gentle sobbing that followed, complemented by a hushed, comforting whisper of words. I heard them picking up the pieces together, both literally and metaphorically, and heaved a sigh of relief.</p>\n<h1 id=\"heading-words-have-power\">Words Have Power</h1>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1763277202294/9330893d-40bc-497f-aee3-ddbbd81225ec.jpeg\" alt class=\"image--center mx-auto\" /></p>\n<p>From that day on, the routine Saturday morning fights ceased. That was also the day that I realized that words had a mystical power to change people and things. As I went through my secondary and tertiary education, I began refining my understanding of the power of words through classes in literature and writing. I discovered that words could be more than just words - they could be prose, poetry or play; they could be sibilance, similes, or symbolism; and they could be Wilde, Wharton or William (Shakespeare).</p>\n<p>Beyond those classes, words continued to grant me the power to change people and things. It was the power of my words through numerous formal letters and emails that allowed me to help my mother, who was Chinese-educated, overcome a difficult lawsuit. It was the power of my words through my inspirational speeches that allowed me to be elected as the President of the Student Council and enact change at my junior college. And finally, it was the power of my words through my application essays that granted me a university scholarship - one that would eventually send me to the University of California, Los Angeles (UCLA).</p>\n<h1 id=\"heading-my-second-love\">My Second Love</h1>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1763277217509/a544ee8e-972f-41eb-9c0a-c3398af2f165.jpeg\" alt class=\"image--center mx-auto\" /></p>\n<p>It was at UCLA that I met my second love - technology. There, I sat through lectures that exposed me to technology and its intricate relationships with all things concerning modern society, ranging from globalization to feminism. I also joined a coding club, where I not only learnt how to use technology to create web applications and blockchains but also taught humanities students how to do the same. Last but not least, I met professors like Dr Rigby and Dr Kleinrock whose passion for exploring technology encouraged me to pursue it as well.</p>\n<h2 id=\"heading-tech-and-writing-complementary-skills\">Tech and Writing: Complementary Skills</h2>\n<p>While my work and academic experiences have led me down an exciting road of exploring the interconnections of science, technology and society, I have not forgotten about my first love, literature and writing. In many ways, these two passions have been largely complementary to each other, despite having arisen at different points in my life.</p>\n<p>For example, these two passions enabled me to view coding and writing under the same light. As I explained to the humanities students in my coding club back at UCLA, both are creative processes that use the power of words to create something out of nothing. Both require a skill at being concise to convey a message effectively, albeit one in terms of runtime and the other in terms of readability.</p>\n<p>I didn’t completely drop literature either, when I was at UCLA! I took up a summer intensive program that brought me to Stratford-upon-Avon and London to study Shakespeare’s plays, and even wrote a research paper analyzing the impact of play venues (I compared the RSC and London Globe, where I watched Shakespeare’s plays) on production values and interpretation of plays. Feel free to read it <a target=\"_blank\" href=\"https://drive.google.com/file/d/1wWUq8BXHIbk7IV77kHgqzJRC6y5bmLBO/view?usp=sharing\">here</a>.</p>\n<p>And lastly, both serve the same purpose of empowering the individual to enact change. As a whole, these differing passions have provided a critical lens for me to understand complex processes that have often been restricted to the definitions of its reigning discipline, which have in turn inspired many of my research interests.</p>\n<h2 id=\"heading-how-do-i-merge-these-interests\">How Do I Merge These Interests?</h2>\n<p>Admittedly, I am still in the process of merging these two interests in a well-defined field that I can clearly own and identify with. From my internship at a blockchain trade association to my first research paper on central bank digital currencies, I have since been trying to carve out a path for myself in using writing to advocate for a better understanding of the intersections between science, technology and society. More recently, I have begun to explore and write about technology on a macro-scale, looking at its role in society as a network of technologies - a ‘technology space’ - rather than focusing on a single technology.</p>\n<h2 id=\"heading-exploring-science-writing\">Exploring Science Writing</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1763277227625/43598db9-c33e-4205-b1ac-490edfb853d0.jpeg\" alt class=\"image--center mx-auto\" /></p>\n<p>I actually had a period of time I was exploring the field of science writing, also known as science communication. While I ended up pursuing a Master’s in Computer Information Systems due to my organizational needs (my tuition was sponsored by my organization, for which I am completing a work contract for in return for the sponsorship), I was looking at science writing programs too enroll into.</p>\n<p>One of them was the MIT Science Writing program, which proved to me that these interests can indeed be unified under an established discipline. If granted the incredible opportunity to be able to formally pursue both my passions under the field of science writing, I was hoping to focus my graduate thesis on the development of the global technology space over history by studying patent data, and through which, provide substantial evidence for the globalization of technology and explanations for identified trends. More importantly, I hoped to be able to write on this topic with a self-defined literary clarity and artfulness that marked scientific literature I keep dear to my heart, such as Alan Lightman’s “Einstein’s Dreams” and James Gleick’s “Chaos: Making a New Science.”</p>\n<p>Applying to these programs didn’t work out, as you might have noticed from my academic background. Still, I guess I did gravitate towards communicating science and technology both inside and outside of my job as a software engineer now. Through creating first-of-its-kind apps, I’ve had to communicate technology to senior leadership within my organisation for buy-in. And of course, in my tech community work and tech podcast outside of my full-time job, you (assuming you came from my socials) already know I communicate tech and tech culture to the wider public through various mediums, like writing (on LinkedIn mostly, and now this blog), short-form videos (I guess I am more known for this now!) and long-form podcast content (yeay to <a target=\"_blank\" href=\"http://ragtechdev.com\">ragTech</a>!).</p>\n<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">💡</div>\n<div data-node-type=\"callout-text\">Psst… our Techie Taboo cards, meant to help communicate tech through a fun game, are now on waitlist! Go to <a target=\"_self\" href=\"https://ragtechdev.com/techie-taboo\">https://ragtechdev.com/techie-taboo</a> to join the waitlist now!</div>\n</div>\n\n<h1 id=\"heading-holding-onto-hope\">Holding onto Hope</h1>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1763277242507/db63afbb-fd35-48c3-867a-fd5af8894aa8.png\" alt class=\"image--center mx-auto\" /></p>\n<p>I still hold hope to eventually find something that helps amalgamate these interests neatly into a well-defined role within an organisation whose values I align with. Or even better, build something for myself. But until then, I will continue living and breathing my two loves - tech and writing.</p>\n<p>All in all, it is with a belief that words, even in purple marker, have a mystical power to influence and empower; a devotion to exploring the intersections of science, technology and society; and finally a newfound identity in the unity of these two interests, that I’ll continue in my work communicating tech to everyone!</p>\n<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">❤‍🔥</div>\n<div data-node-type=\"callout-text\">You can connect with me at whichever social platform you prefer on <a target=\"_self\" href=\"https://natashaannn.com/links\">https://natashaannn.com/links</a>! And of course, you’ll see me on ragTech too, so make sure to follow and subscribe across our channels!</div>\n</div>",
    "markdown": "While most of my acquaintances would very quickly identify me as a science and technology aficionado, many are quick to overlook the fact that this passion of mine was relatively recently discovered (against the backdrop of my 28 years of living). Before I went to the United States and was welcomed into the field of science and technology, I carried a persona that was always associated with a drastically different discipline, one that would almost never have been associated with science and technology back in Singapore - literature and writing.\n\n# My First Love\n\n![No photo description available.](https://scontent.fsin13-1.fna.fbcdn.net/v/t39.30808-6/516869601_10162559050868213_6167643404255647118_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=cf85f3&_nc_ohc=Ckcw50hANwMQ7kNvwGSE_dI&_nc_oc=AdkEHyTsU-qSswsVZmzxybG2qzfm2wTK7ioJuMCjzhlaeKGNR4_IkeO5F0Kt7pEaaOk&_nc_zt=23&_nc_ht=scontent.fsin13-1.fna&_nc_gid=8Yg2Nl7Wkic4lDLF01OpaA&oh=00_AfgZ5O8Y6Fe_vKp5ndOnhivNy3o3plo4CMM0NIoz6isR4Q&oe=691F514E align=\"center\")\n\nLiterature and writing was always my first love. As a child, I loved that each and every one of my pocket-sized Enid Blyton books would take me on an exhilarating ride into a new world, offering me an exciting variety of fictional companions and landscapes that I could recreate in the fantastical space that was a child's imagination. I would have exercise books and coloring pencils and markers strewn all over my bedroom floor as I penned (or in this case, penciled and markered) my own stories, complete with arguably accurate illustrations of my characters.\n\n## A Refuge\n\n![No photo description available.](https://scontent.fsin13-1.fna.fbcdn.net/v/t39.30808-6/517409104_10162559050873213_4843897632190733910_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=cf85f3&_nc_ohc=1AemxhscxasQ7kNvwFYn1a2&_nc_oc=Adk4m72nRR7wKNf0Y4IMPFH8ahNFBYeTuZ9wpw_7_eHyjqvz4j9b8PZsSrbgBzRGf1k&_nc_zt=23&_nc_ht=scontent.fsin13-1.fna&_nc_gid=W9jcimUPZluCYdAfM5iJBw&oh=00_AfhGwy6OBWSonfvymjqpB6oOtRnv6VAwDoJsnZhK4GYFiA&oe=691F5F2E align=\"center\")\n\nReading and writing gave me refuge from difficult times at home when my parents were still going through a rough patch (they are great now! Just acknowledging that raising children can create lots of tension in families). In fact, it gave me more than just refuge - it gave me the courage to express my thoughts when I felt disempowered to express them verbally.\n\nI remember waking up to a fight between my parents on a Saturday morning. Despite being behind closed doors, the hollow walls and chipwood doors hardly offered a disguise for the ugliness that was happening behind them. I would cower in the corner or my bed, fearful and confused, regardless of the numerous episodes of this nightmarish podcast I had already sat through.\n\nThis time, however, the podcast was at its climax.\n\nI heard a muffled, threatening shout, followed by a shrill scream. There was a brief silence, and then a frightening thud on the door - the shattering of ceramic echoed through the confines of our small apartment. I darted out of my bed and dashed for the door, nimbly tiptoeing past the shattered ceramic pieces that were once a pristine dove ornament, now scattered in front of my parents' bedroom. Pressing my ears against the door, I listened attentively for a sign that my parents were not hurt, and was relieved to hear them continue in their angered row.\n\n## When My Voice Didn’t Help, Words Did\n\n![No photo description available.](https://scontent.fsin13-1.fna.fbcdn.net/v/t39.30808-6/517438852_10162559050828213_2320198346537234694_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=cf85f3&_nc_ohc=Kvp6gz20EtoQ7kNvwGNSFFB&_nc_oc=AdnxSOcwCBYBsljmRGGOIrNX9IYxXhZ1yBbUxg4eUGxjiwlbEO7-9N_m-4GQGfR183g&_nc_zt=23&_nc_ht=scontent.fsin13-1.fna&_nc_gid=c-ek409VAcbEQTtY2WSqmA&oh=00_Afius5mJt_Zx9ljv_t7bqtnmS6dEDboMRU_SorYTvhugrw&oe=691F474C align=\"center\")\n\nThat was the point that I decided that I needed to end this traumatic series of arguments. I clenched my jaw and tightened my throat, looking for the strength and the words to convey my words over their bickering.\n\nNo words came, not even a croak.\n\nOut of the corner of my eye, however, I noticed one of my purple markers lying by a ceramic piece. Intuition took hold - I grabbed the marker with one hand and gently cradled the ceramic piece in the other, slowly scribbling down my message with the best words that existed within my limited lexicon.\n\n“Please stop quareling, it makes me upset.”\n\nI pursed my lips, wondering if I had spelt quarreling right. I assumed I did. I cautiously slid the piece through the door and hoped my parents would notice.\n\nAnd they did. Almost immediately, there was a hushed silence and then a hurried pitter-patter of footsteps toward the door. I scrambled up to my feet and creeped hurriedly back into my bed, straining my ears to listen out for what would ensue. There was a gentle sobbing that followed, complemented by a hushed, comforting whisper of words. I heard them picking up the pieces together, both literally and metaphorically, and heaved a sigh of relief.\n\n# Words Have Power\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1763277202294/9330893d-40bc-497f-aee3-ddbbd81225ec.jpeg align=\"center\")\n\nFrom that day on, the routine Saturday morning fights ceased. That was also the day that I realized that words had a mystical power to change people and things. As I went through my secondary and tertiary education, I began refining my understanding of the power of words through classes in literature and writing. I discovered that words could be more than just words - they could be prose, poetry or play; they could be sibilance, similes, or symbolism; and they could be Wilde, Wharton or William (Shakespeare).\n\nBeyond those classes, words continued to grant me the power to change people and things. It was the power of my words through numerous formal letters and emails that allowed me to help my mother, who was Chinese-educated, overcome a difficult lawsuit. It was the power of my words through my inspirational speeches that allowed me to be elected as the President of the Student Council and enact change at my junior college. And finally, it was the power of my words through my application essays that granted me a university scholarship - one that would eventually send me to the University of California, Los Angeles (UCLA).\n\n# My Second Love\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1763277217509/a544ee8e-972f-41eb-9c0a-c3398af2f165.jpeg align=\"center\")\n\nIt was at UCLA that I met my second love - technology. There, I sat through lectures that exposed me to technology and its intricate relationships with all things concerning modern society, ranging from globalization to feminism. I also joined a coding club, where I not only learnt how to use technology to create web applications and blockchains but also taught humanities students how to do the same. Last but not least, I met professors like Dr Rigby and Dr Kleinrock whose passion for exploring technology encouraged me to pursue it as well.\n\n## Tech and Writing: Complementary Skills\n\nWhile my work and academic experiences have led me down an exciting road of exploring the interconnections of science, technology and society, I have not forgotten about my first love, literature and writing. In many ways, these two passions have been largely complementary to each other, despite having arisen at different points in my life.\n\nFor example, these two passions enabled me to view coding and writing under the same light. As I explained to the humanities students in my coding club back at UCLA, both are creative processes that use the power of words to create something out of nothing. Both require a skill at being concise to convey a message effectively, albeit one in terms of runtime and the other in terms of readability.\n\nI didn’t completely drop literature either, when I was at UCLA! I took up a summer intensive program that brought me to Stratford-upon-Avon and London to study Shakespeare’s plays, and even wrote a research paper analyzing the impact of play venues (I compared the RSC and London Globe, where I watched Shakespeare’s plays) on production values and interpretation of plays. Feel free to read it [here](https://drive.google.com/file/d/1wWUq8BXHIbk7IV77kHgqzJRC6y5bmLBO/view?usp=sharing).\n\nAnd lastly, both serve the same purpose of empowering the individual to enact change. As a whole, these differing passions have provided a critical lens for me to understand complex processes that have often been restricted to the definitions of its reigning discipline, which have in turn inspired many of my research interests.\n\n## How Do I Merge These Interests?\n\nAdmittedly, I am still in the process of merging these two interests in a well-defined field that I can clearly own and identify with. From my internship at a blockchain trade association to my first research paper on central bank digital currencies, I have since been trying to carve out a path for myself in using writing to advocate for a better understanding of the intersections between science, technology and society. More recently, I have begun to explore and write about technology on a macro-scale, looking at its role in society as a network of technologies - a ‘technology space’ - rather than focusing on a single technology.\n\n## Exploring Science Writing\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1763277227625/43598db9-c33e-4205-b1ac-490edfb853d0.jpeg align=\"center\")\n\nI actually had a period of time I was exploring the field of science writing, also known as science communication. While I ended up pursuing a Master’s in Computer Information Systems due to my organizational needs (my tuition was sponsored by my organization, for which I am completing a work contract for in return for the sponsorship), I was looking at science writing programs too enroll into.\n\nOne of them was the MIT Science Writing program, which proved to me that these interests can indeed be unified under an established discipline. If granted the incredible opportunity to be able to formally pursue both my passions under the field of science writing, I was hoping to focus my graduate thesis on the development of the global technology space over history by studying patent data, and through which, provide substantial evidence for the globalization of technology and explanations for identified trends. More importantly, I hoped to be able to write on this topic with a self-defined literary clarity and artfulness that marked scientific literature I keep dear to my heart, such as Alan Lightman’s “Einstein’s Dreams” and James Gleick’s “Chaos: Making a New Science.”\n\nApplying to these programs didn’t work out, as you might have noticed from my academic background. Still, I guess I did gravitate towards communicating science and technology both inside and outside of my job as a software engineer now. Through creating first-of-its-kind apps, I’ve had to communicate technology to senior leadership within my organisation for buy-in. And of course, in my tech community work and tech podcast outside of my full-time job, you (assuming you came from my socials) already know I communicate tech and tech culture to the wider public through various mediums, like writing (on LinkedIn mostly, and now this blog), short-form videos (I guess I am more known for this now!) and long-form podcast content (yeay to [ragTech](http://ragtechdev.com)!).\n\n<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">💡</div>\n<div data-node-type=\"callout-text\">Psst… our Techie Taboo cards, meant to help communicate tech through a fun game, are now on waitlist! Go to <a target=\"_self\" rel=\"noopener noreferrer nofollow\" href=\"https://ragtechdev.com/techie-taboo\" style=\"pointer-events: none\">https://ragtechdev.com/techie-taboo</a> to join the waitlist now!</div>\n</div>\n\n# Holding onto Hope\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1763277242507/db63afbb-fd35-48c3-867a-fd5af8894aa8.png align=\"center\")\n\nI still hold hope to eventually find something that helps amalgamate these interests neatly into a well-defined role within an organisation whose values I align with. Or even better, build something for myself. But until then, I will continue living and breathing my two loves - tech and writing.\n\nAll in all, it is with a belief that words, even in purple marker, have a mystical power to influence and empower; a devotion to exploring the intersections of science, technology and society; and finally a newfound identity in the unity of these two interests, that I’ll continue in my work communicating tech to everyone!\n\n<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">❤‍🔥</div>\n<div data-node-type=\"callout-text\">You can connect with me at whichever social platform you prefer on <a target=\"_self\" rel=\"noopener noreferrer nofollow\" href=\"https://natashaannn.com/links\" style=\"pointer-events: none\">https://natashaannn.com/links</a>! And of course, you’ll see me on ragTech too, so make sure to follow and subscribe across our channels!</div>\n</div>"
  },
  "tags": [
    {
      "name": "#EngineeringJourney   ",
      "slug": "engineeringjourney"
    },
    {
      "name": "literature",
      "slug": "literature"
    },
    {
      "name": "writing",
      "slug": "writing"
    },
    {
      "name": "journey into tech",
      "slug": "journey-into-tech"
    }
  ],
  "_archived": {
    "source": "hashnode",
    "archived_date": "2026-01-20T03:54:58.980Z",
    "original_url": "https://blog.ragtechdev.com/before-tech-my-first-love-was-literature"
  }
}