{
  "id": "6621439b77f50f29b3de04c5",
  "title": "How to Elevate Your Tech Careers: Yumin's Journey to Staff Software Engineer",
  "brief": "In this episode, we invited Yumin Wong as a guest to discuss the role of a Staff Software Engineer and the transition from being a Senior Software Engineer to a Staff Software Engineer. There are a lot of things to cover in the role such as being a v...",
  "slug": "how-to-elevate-your-tech-careers-yumins-journey-to-staff-software-engineer",
  "coverImage": {
    "url": "https://cdn.hashnode.com/res/hashnode/image/upload/v1712897996557/d257e0e0-d6f1-4408-ac31-d25673087f40.png"
  },
  "publishedAt": "2024-04-18T16:00:27.205Z",
  "readTimeInMinutes": 5,
  "author": {
    "name": "Victoria Lo",
    "profilePicture": "https://cdn.hashnode.com/res/hashnode/image/upload/v1767713322721/dfbc8b12-1ce5-4b0a-9966-981c90caec33.jpeg?w=500&h=500&fit=crop&crop=entropy&auto=compress,format&format=webp"
  },
  "content": {
    "html": "<p>In this episode, we invited Yumin Wong as a guest to discuss the role of a Staff Software Engineer and the transition from being a Senior Software Engineer to a Staff Software Engineer. There are a lot of things to cover in the role such as being a value multiplier for the team and organization, focusing on availability, scalability, and extensibility, and requiring effective communication and a broad impact and scope.</p>\n<p>Yumin also shares her personal experiences with learning programming, overcoming challenges in college, and adapting to different work environments. Additionally, we discuss the significance of women mentors in careers and the importance of having diverse perspectives in the tech industry! Do tune in to this episode filled with valuable insights!</p>\n<div class=\"embed-wrapper\"><div class=\"embed-loading\"><div class=\"loadingRow\"></div><div class=\"loadingRow\"></div></div><a class=\"embed-card\" href=\"https://youtu.be/fWrDgodgmLU\">https://youtu.be/fWrDgodgmLU</a></div>\n<p> </p>\n<div class=\"embed-wrapper\"><div class=\"embed-loading\"><div class=\"loadingRow\"></div><div class=\"loadingRow\"></div></div><a class=\"embed-card\" href=\"https://open.spotify.com/episode/0habBN7lu4ZrbcLb1P70KF\">https://open.spotify.com/episode/0habBN7lu4ZrbcLb1P70KF</a></div>\n<p> </p>\n<h2 id=\"heading-what-is-a-staff-software-engineer\">What is a Staff Software Engineer?</h2>\n<p>Yumin shares the role of a Staff Software Engineer and the transition from being a Senior Software Engineer to a Staff Software Engineer.<br />A Staff Software Engineer role involves:</p>\n<ul>\n<li><p>Being a value multiplier, not just for one's team but also for the organization as a whole</p>\n</li>\n<li><p>Cross-team and cross-function collaboration, ensuring projects are well-rounded, and focusing on engineering aspects such as availability, scalability, and extensibility</p>\n</li>\n<li><p>Effective communication and a broad impact and scope</p>\n</li>\n</ul>\n<h2 id=\"heading-yumins-journey-into-tech\">Yumin's Journey into Tech</h2>\n<p>Yumin was struggling with for loops during her first Java programming course in college, which made her feel behind compared to her peers who had a computing background in high school.</p>\n<p>However, she overcame impostor syndrome by leaning on her professors and peers for support, recognizing her weaknesses, and figuring out her resources. She also emphasized the importance of <strong>visual feedback</strong> and the iterative nature of software engineering in their learning process.</p>\n<p>She emphasizes the <strong>importance of asking for help and breaking down big problems into smaller, manageable tasks</strong>.</p>\n<p>Joining societies like Women in Tech and the Singapore Student Association, also helped Yumin find her community and gained valuable networking opportunities. She led the project and felt it prepared her for working outside of her comfort zone and eventually <strong>landing an internship</strong> at a New York equity trading firm.</p>\n<p>Yumin emphasizes the importance of finding a work environment that aligns with personal values and preferences. She then elaborated on the <strong>expectations versus reality of working in the US</strong>, particularly in places like Silicon Valley, and the importance of diversity and inclusion.</p>\n<h2 id=\"heading-adapting-to-different-working-environments\">Adapting to Different Working Environments</h2>\n<p>Yumin's career journey consists of adapting to different work environments and <strong>making career decisions based on her strengths</strong>, limitations, and financial considerations. Initially, she felt anxious about her inability to keep up with the fast pace of New York City and the pressure to speak up in meetings.</p>\n<p>After three months, she learned to assert herself and recognize her <strong>strengths as an observer and deep thinker</strong>. When choosing between job offers in Boston, New York, and Chicago, she considered the <strong>financial feasibility and cultural fit</strong> of each company.</p>\n<p>Eventually, she landed a job in Chicago and went on to work in various roles, from a midsize firm to a startup, before settling in a decent-sized global company. At a point in her career, she shifted her focus from personal growth to helping others and pushing herself out of her comfort zone through new experiences like podcasting and public speaking.</p>\n<h2 id=\"heading-the-significance-of-women-mentors\">The Significance of Women Mentors</h2>\n<p>Yumin discusses the significance of women mentors in her career journey in the tech industry. She explains that finding mentors is a combination of luck and personal drive, and emphasizes the importance of having mentors who are both similar and different from oneself for diverse perspectives.</p>\n<p>Her mother, an early female lecturer in electrical computer engineering, was a major inspiration for her. She also mentions that in her earlier companies, the ratio of women was low, and she values the connections she's made with fellow women in tech. One of her biggest takeaways is to be <strong>confident in one's abilities</strong> and building skills you are passionate about.</p>\n<h2 id=\"heading-whats-next-for-yumin\">What's Next for Yumin?</h2>\n<p>Yumin's career goal at this moment is pursuing a principal engineer role. Currently working in a team with a majority of members in the US, she expresses concerns about the time zone differences and ability to rally troops for such a position.</p>\n<p>Yumin also reflects on her past experiences and the importance of embracing her unique strengths and values. She acknowledges that the next step in her journey, becoming a principal engineer, is uncertain and is taking time to consider the feasibility of this goal.</p>\n<p>Also, she emphasizes the importance of taking breaks and gaining a broader perspective to make informed decisions about her career. So she plans to take it slow and enjoy the ride!</p>\n<h2 id=\"heading-conclusion\">Conclusion</h2>\n<p>We are super grateful to feature Yumin in this episode! She is a true inspiration to many people in tech and we are honoured to have a chat with her! If you have any questions for Yumin, feel free to reach out to her on her <a target=\"_blank\" href=\"https://www.linkedin.com/in/yuminwong/\">LinkedIn</a>!</p>\n<p>We hope you enjoyed the recap of this episode! We discussed a lot more that we did not mention in this article. We will be going into a lot more topics soon! Do leave your thoughts or any feedback in the comments below! What are some topics you would want us to talk about or cover? What are some areas we could improve on? Feel free to let us know!</p>\n<p>✨Follow us on our socials so you don't miss the next episode!</p>\n<ul>\n<li><p><a target=\"_blank\" href=\"https://www.instagram.com/ragtechdev/\"><strong>Instagram</strong></a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://twitter.com/ragtechdev\"><strong>X</strong></a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://www.youtube.com/@ragTechDev\"><strong>YouTube</strong></a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://open.spotify.com/show/1KfM9JTWsDQ5QoMYEh489d\"><strong>Spotify</strong></a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://linktr.ee/ragtechdev\"><strong>More Links</strong></a></p>\n</li>\n</ul>\n",
    "markdown": "In this episode, we invited Yumin Wong as a guest to discuss the role of a Staff Software Engineer and the transition from being a Senior Software Engineer to a Staff Software Engineer. There are a lot of things to cover in the role such as being a value multiplier for the team and organization, focusing on availability, scalability, and extensibility, and requiring effective communication and a broad impact and scope.\n\nYumin also shares her personal experiences with learning programming, overcoming challenges in college, and adapting to different work environments. Additionally, we discuss the significance of women mentors in careers and the importance of having diverse perspectives in the tech industry! Do tune in to this episode filled with valuable insights!\n\n%[https://youtu.be/fWrDgodgmLU] \n\n%[https://open.spotify.com/episode/0habBN7lu4ZrbcLb1P70KF] \n\n## What is a Staff Software Engineer?\n\nYumin shares the role of a Staff Software Engineer and the transition from being a Senior Software Engineer to a Staff Software Engineer.  \nA Staff Software Engineer role involves:\n\n* Being a value multiplier, not just for one's team but also for the organization as a whole\n    \n* Cross-team and cross-function collaboration, ensuring projects are well-rounded, and focusing on engineering aspects such as availability, scalability, and extensibility\n    \n* Effective communication and a broad impact and scope\n    \n\n## Yumin's Journey into Tech\n\nYumin was struggling with for loops during her first Java programming course in college, which made her feel behind compared to her peers who had a computing background in high school.\n\nHowever, she overcame impostor syndrome by leaning on her professors and peers for support, recognizing her weaknesses, and figuring out her resources. She also emphasized the importance of **visual feedback** and the iterative nature of software engineering in their learning process.\n\nShe emphasizes the **importance of asking for help and breaking down big problems into smaller, manageable tasks**.\n\nJoining societies like Women in Tech and the Singapore Student Association, also helped Yumin find her community and gained valuable networking opportunities. She led the project and felt it prepared her for working outside of her comfort zone and eventually **landing an internship** at a New York equity trading firm.\n\nYumin emphasizes the importance of finding a work environment that aligns with personal values and preferences. She then elaborated on the **expectations versus reality of working in the US**, particularly in places like Silicon Valley, and the importance of diversity and inclusion.\n\n## Adapting to Different Working Environments\n\nYumin's career journey consists of adapting to different work environments and **making career decisions based on her strengths**, limitations, and financial considerations. Initially, she felt anxious about her inability to keep up with the fast pace of New York City and the pressure to speak up in meetings.\n\nAfter three months, she learned to assert herself and recognize her **strengths as an observer and deep thinker**. When choosing between job offers in Boston, New York, and Chicago, she considered the **financial feasibility and cultural fit** of each company.\n\nEventually, she landed a job in Chicago and went on to work in various roles, from a midsize firm to a startup, before settling in a decent-sized global company. At a point in her career, she shifted her focus from personal growth to helping others and pushing herself out of her comfort zone through new experiences like podcasting and public speaking.\n\n## The Significance of Women Mentors\n\nYumin discusses the significance of women mentors in her career journey in the tech industry. She explains that finding mentors is a combination of luck and personal drive, and emphasizes the importance of having mentors who are both similar and different from oneself for diverse perspectives.\n\nHer mother, an early female lecturer in electrical computer engineering, was a major inspiration for her. She also mentions that in her earlier companies, the ratio of women was low, and she values the connections she's made with fellow women in tech. One of her biggest takeaways is to be **confident in one's abilities** and building skills you are passionate about.\n\n## What's Next for Yumin?\n\nYumin's career goal at this moment is pursuing a principal engineer role. Currently working in a team with a majority of members in the US, she expresses concerns about the time zone differences and ability to rally troops for such a position.\n\nYumin also reflects on her past experiences and the importance of embracing her unique strengths and values. She acknowledges that the next step in her journey, becoming a principal engineer, is uncertain and is taking time to consider the feasibility of this goal.\n\nAlso, she emphasizes the importance of taking breaks and gaining a broader perspective to make informed decisions about her career. So she plans to take it slow and enjoy the ride!\n\n## Conclusion\n\nWe are super grateful to feature Yumin in this episode! She is a true inspiration to many people in tech and we are honoured to have a chat with her! If you have any questions for Yumin, feel free to reach out to her on her [LinkedIn](https://www.linkedin.com/in/yuminwong/)!\n\nWe hope you enjoyed the recap of this episode! We discussed a lot more that we did not mention in this article. We will be going into a lot more topics soon! Do leave your thoughts or any feedback in the comments below! What are some topics you would want us to talk about or cover? What are some areas we could improve on? Feel free to let us know!\n\n✨Follow us on our socials so you don't miss the next episode!\n\n* [**Instagram**](https://www.instagram.com/ragtechdev/)\n    \n* [**X**](https://twitter.com/ragtechdev)\n    \n* [**YouTube**](https://www.youtube.com/@ragTechDev)\n    \n* [**Spotify**](https://open.spotify.com/show/1KfM9JTWsDQ5QoMYEh489d)\n    \n* [**More Links**](https://linktr.ee/ragtechdev)"
  },
  "tags": [
    {
      "name": "Career",
      "slug": "career"
    },
    {
      "name": "podcast",
      "slug": "podcast"
    },
    {
      "name": "Software Engineering",
      "slug": "software-engineering"
    },
    {
      "name": "advice",
      "slug": "advice"
    },
    {
      "name": "technology",
      "slug": "technology"
    }
  ],
  "_archived": {
    "source": "hashnode",
    "archived_date": "2026-01-20T03:54:58.980Z",
    "original_url": "https://blog.ragtechdev.com/how-to-elevate-your-tech-careers-yumins-journey-to-staff-software-engineer"
  }
}