{
  "id": "6768f1c75423bc3e5fca3a2b",
  "title": "Key Insights from 2024: Learnings from Our Podcast Guests",
  "brief": "In 2024, our ragTech guests shared a wealth of knowledge, offering insights on everything from career growth to work-life balance, mentorship, and navigating professional challenges.\nWhether it was about fostering inclusivity, mastering self-promotio...",
  "slug": "key-insights-from-2024-learnings-from-our-podcast-guests",
  "coverImage": {
    "url": "https://cdn.hashnode.com/res/hashnode/image/upload/v1734315360776/5eec3290-a8e6-4558-9143-b8f4c4a2b171.png"
  },
  "publishedAt": "2024-12-23T05:14:47.324Z",
  "readTimeInMinutes": 5,
  "author": {
    "name": "Victoria Lo",
    "profilePicture": "https://cdn.hashnode.com/res/hashnode/image/upload/v1767713322721/dfbc8b12-1ce5-4b0a-9966-981c90caec33.jpeg?w=500&h=500&fit=crop&crop=entropy&auto=compress,format&format=webp"
  },
  "content": {
    "html": "<p>In 2024, our ragTech guests shared a wealth of knowledge, offering insights on everything from career growth to work-life balance, mentorship, and navigating professional challenges.</p>\n<p>Whether it was about fostering inclusivity, mastering self-promotion, or balancing personal and professional roles, each conversation provided valuable takeaways for both seasoned professionals and newcomers alike. In this post, we’ll highlight the key lessons shared by our guests, reflecting the diverse experiences and wisdom they brought to the table.</p>\n<h2 id=\"heading-ep-10-13-14-yumin-wong\">Ep 10, 13, 14: Yumin Wong</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1733904729960/8d58c5c5-207f-4d0f-9177-0ecdf643d2da.png\" alt class=\"image--center mx-auto\" /></p>\n<h4 id=\"heading-career-growth-amp-development\"><strong>Career Growth &amp; Development:</strong></h4>\n<ul>\n<li><p><strong>Career Progression</strong>: Insights into advancing to a senior role like Staff Software Engineer.</p>\n</li>\n<li><p><strong>Mentorship &amp; Advice</strong>: The value of seeking mentorship and offering guidance to others.</p>\n</li>\n<li><p><strong>Feedback Matters</strong>: The importance of both visual and constructive feedback for growth.</p>\n</li>\n<li><p><strong>Networking</strong>: Attending career fairs and fostering meaningful connections are key to professional development.</p>\n</li>\n<li><p><strong>Global Experience</strong>: Exposure to international work cultures broadens perspective.</p>\n</li>\n<li><p><strong>Commitment</strong>: Keeping promises and delivering results builds trust in professional relationships.</p>\n</li>\n</ul>\n<h4 id=\"heading-work-life-balance-amp-family\"><strong>Work-Life Balance &amp; Family:</strong></h4>\n<ul>\n<li><p><strong>Balancing Roles</strong>: Managing both motherhood and a career, especially in the early stages.</p>\n</li>\n<li><p><strong>Supportive Work Environment</strong>: The importance of a supportive work culture where needs can be communicated.</p>\n</li>\n<li><p><strong>Setting Expectations</strong>: Clear expectations from both employers and family members help balance responsibilities.</p>\n</li>\n<li><p><strong>Communication with Managers</strong>: Open conversations with managers are essential for navigating personal and professional challenges.</p>\n</li>\n<li><p><strong>Support for New Parents</strong>: Normalizing breaks for breastfeeding and understanding from coworkers and managers.</p>\n</li>\n<li><p><strong>Professionalism &amp; Intentions</strong>: Balancing responsibilities while maintaining professionalism and clear intentions.</p>\n</li>\n<li><p><strong>Empathy &amp; Support</strong>: Encouraging individuals to seek support when struggling to balance professional and personal roles.</p>\n</li>\n</ul>\n<h4 id=\"heading-effective-communication-amp-collaboration\"><strong>Effective Communication &amp; Collaboration:</strong></h4>\n<ul>\n<li><p><strong>One-on-One Meetings</strong>: Preparing agendas for productive one-on-one discussions with colleagues and managers.</p>\n</li>\n<li><p><strong>Building Rapport</strong>: Creating relationships through regular communication and knowledge-sharing.</p>\n</li>\n<li><p><strong>Constructive Feedback</strong>: Using frameworks like non-violent communication for respectful and effective feedback.</p>\n</li>\n<li><p><strong>Addressing Uncomfortable Situations</strong>: Open communication and a solution-focused approach to handling workplace discomfort.</p>\n</li>\n</ul>\n<h4 id=\"heading-self-advocacy-amp-community-building\"><strong>Self-Advocacy &amp; Community Building:</strong></h4>\n<ul>\n<li><p><strong>Self-Promotion</strong>: Sharing both achievements and failures as a means to advocate for oneself and promote team growth.</p>\n</li>\n<li><p><strong>Sharing Knowledge</strong>: Viewing self-promotion as an opportunity to share valuable insights with others.</p>\n</li>\n<li><p><strong>Community Building</strong>: Being part of a community helps reduce isolation and provides mutual support in professional settings.</p>\n</li>\n</ul>\n<h2 id=\"heading-ep-15-amp-16-joanna\">Ep 15 &amp; 16: Joanna</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1733904649058/058e9fb1-2163-4f02-8bb7-e51be7855672.png\" alt class=\"image--center mx-auto\" /></p>\n<ul>\n<li><p><strong>Tailor Your Resume</strong>: Customize your resume for each job application, keeping it concise and focused on key skills and experiences.</p>\n</li>\n<li><p><strong>Cultural Differences</strong>: Be aware of cultural variations in recruitment processes, with quicker decision-making in the US versus more drawn-out processes in Singapore.</p>\n</li>\n<li><p><strong>Networking</strong>: Attend events to build personal connections with recruiters and avoid aggressive approaches.</p>\n</li>\n<li><p><strong>Technical vs Non-Technical Roles</strong>: Recruitment processes differ for technical and non-technical roles.</p>\n</li>\n<li><p><strong>Interviewing Styles</strong>: Adapt your interview style to the expectations of the recruiter and cultural norms.</p>\n</li>\n<li><p><strong>Effective Communication</strong>: Strong communication and presentation skills are essential to stand out to recruiters.</p>\n</li>\n</ul>\n<h2 id=\"heading-ep-17-amp-20-andrew\">Ep 17 &amp; 20: Andrew</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1733904555936/0797da7b-0230-43fa-90a5-ba0186027f85.png\" alt class=\"image--center mx-auto\" /></p>\n<h4 id=\"heading-career-amp-personal-growth\"><strong>Career &amp; Personal Growth</strong></h4>\n<ul>\n<li><p><strong>AI's Impact</strong>: Human intervention and customization will remain essential despite AI's influence on software development.</p>\n</li>\n<li><p><strong>Real-World Experience</strong>: Hands-on experience through internships and projects is vital for growth.</p>\n</li>\n<li><p><strong>Effective Communication</strong>: Clear communication with teams is crucial for success in software engineering.</p>\n</li>\n<li><p><strong>Finding Passion</strong>: Identify personal interests within the field to stay motivated and focused.</p>\n</li>\n<li><p><strong>Energy Management</strong>: Managing energy helps maintain productivity and avoid burnout.</p>\n</li>\n<li><p><strong>Mentorship Balance</strong>: Balance mentoring junior engineers with giving them space to solve problems independently.</p>\n</li>\n</ul>\n<h4 id=\"heading-work-life-balance-amp-parenting\"><strong>Work-Life Balance &amp; Parenting</strong></h4>\n<ul>\n<li><p><strong>Balancing Work &amp; Fatherhood</strong>: Time management and adaptability are key to balancing work and childcare.</p>\n</li>\n<li><p><strong>Technology for Support</strong>: Tools like baby monitor apps streamline parenting tasks and support work-life balance.</p>\n</li>\n<li><p><strong>Equal Parental Involvement</strong>: Equal involvement from both parents ensures shared responsibility in childcare.</p>\n</li>\n<li><p><strong>Communication &amp; Delegation</strong>: Clear communication with partners enables effective task delegation and balanced responsibilities.</p>\n</li>\n</ul>\n<h4 id=\"heading-teamwork-amp-collaboration\"><strong>Teamwork &amp; Collaboration</strong></h4>\n<ul>\n<li><p><strong>Parallels to Software Engineering</strong>: Teamwork and collaboration in parenting mirror the skills necessary for success in software development.</p>\n</li>\n<li><p><strong>Adaptation &amp; Growth</strong>: Adapting to new routines and growing together as a team is essential both in parenting and professional environments.</p>\n</li>\n</ul>\n<h2 id=\"heading-ep-18-amp-21-martin\">Ep 18 &amp; 21: Martin</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1733904432931/f501dbdb-db57-41b5-957c-fbe30f96dd0e.png\" alt class=\"image--center mx-auto\" /></p>\n<h4 id=\"heading-open-source-and-community-engagement\">Open Source and Community Engagement:</h4>\n<ul>\n<li><p><strong>Open Source Concept</strong>: Open source is about freely sharing software code to foster collaboration and innovation.</p>\n</li>\n<li><p><strong>Benefits of Open Source</strong>: Contributing to open source enhances the tech ecosystem and promotes community involvement.</p>\n</li>\n<li><p><strong>Challenges of Maintaining Projects</strong>: Maintaining open source projects offers both rewarding contributions and the risk of burnout.</p>\n</li>\n<li><p><strong>Tech Meetups &amp; Engagement</strong>: Organizing tech meetups is challenging but essential for continuous learning, building relationships, and fostering community engagement.</p>\n</li>\n<li><p><strong>Engagement and Learning</strong>: Staying connected with the tech community and prioritizing ongoing learning is critical for growth.</p>\n</li>\n<li><p><strong>Future Plans</strong>: The creators plan to develop a website for their tech show to enhance community engagement.</p>\n</li>\n</ul>\n<h4 id=\"heading-financial-freedom-and-bitcoin-investment\">Financial Freedom and Bitcoin Investment:</h4>\n<ul>\n<li><p><strong>Dollar-Cost Averaging</strong>: Consistent Bitcoin purchases through dollar-cost averaging resulted in significant returns (10x) over four years.</p>\n</li>\n<li><p><strong>Long-Term Planning &amp; Financial Discipline</strong>: Patience, long-term planning, and disciplined saving and budgeting led to Martin's financial independence.</p>\n</li>\n<li><p><strong>Psychological Mindset &amp; Self-Awareness</strong>: Maintaining a strong mindset, being self-aware, and staying disciplined are crucial when navigating volatile markets like Bitcoin.</p>\n</li>\n<li><p><strong>Understanding Bitcoin &amp; Tools for Success</strong>: A deep understanding of Bitcoin fundamentals and using budgeting tools like You Need a Budget helped in making informed investment decisions and managing finances effectively.</p>\n</li>\n</ul>\n<h2 id=\"heading-conclusion\">Conclusion</h2>\n<p>We are deeply grateful to each guest for taking the time out of their busy schedules to share their wisdom and stories with us. From navigating professional challenges to offering practical advice on mentorship, parenting, and financial independence, their contributions have been both inspiring and enriching. As we look ahead, these conversations encourage us to keep learning, supporting one another, and building inclusive, thriving communities in tech and beyond 🍻</p>\n<p>We also want to thank our followers and subscribers for your invaluable feedback and continued support throughout the year. Your engagement motivates us to keep creating meaningful content. Stay tuned for more bytes and banter from ragTech in 2025—we’re excited to bring you even more inspiring conversations and insights! 🥳</p>\n",
    "markdown": "In 2024, our ragTech guests shared a wealth of knowledge, offering insights on everything from career growth to work-life balance, mentorship, and navigating professional challenges.\n\nWhether it was about fostering inclusivity, mastering self-promotion, or balancing personal and professional roles, each conversation provided valuable takeaways for both seasoned professionals and newcomers alike. In this post, we’ll highlight the key lessons shared by our guests, reflecting the diverse experiences and wisdom they brought to the table.\n\n## Ep 10, 13, 14: Yumin Wong\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1733904729960/8d58c5c5-207f-4d0f-9177-0ecdf643d2da.png align=\"center\")\n\n#### **Career Growth & Development:**\n\n* **Career Progression**: Insights into advancing to a senior role like Staff Software Engineer.\n    \n* **Mentorship & Advice**: The value of seeking mentorship and offering guidance to others.\n    \n* **Feedback Matters**: The importance of both visual and constructive feedback for growth.\n    \n* **Networking**: Attending career fairs and fostering meaningful connections are key to professional development.\n    \n* **Global Experience**: Exposure to international work cultures broadens perspective.\n    \n* **Commitment**: Keeping promises and delivering results builds trust in professional relationships.\n    \n\n#### **Work-Life Balance & Family:**\n\n* **Balancing Roles**: Managing both motherhood and a career, especially in the early stages.\n    \n* **Supportive Work Environment**: The importance of a supportive work culture where needs can be communicated.\n    \n* **Setting Expectations**: Clear expectations from both employers and family members help balance responsibilities.\n    \n* **Communication with Managers**: Open conversations with managers are essential for navigating personal and professional challenges.\n    \n* **Support for New Parents**: Normalizing breaks for breastfeeding and understanding from coworkers and managers.\n    \n* **Professionalism & Intentions**: Balancing responsibilities while maintaining professionalism and clear intentions.\n    \n* **Empathy & Support**: Encouraging individuals to seek support when struggling to balance professional and personal roles.\n    \n\n#### **Effective Communication & Collaboration:**\n\n* **One-on-One Meetings**: Preparing agendas for productive one-on-one discussions with colleagues and managers.\n    \n* **Building Rapport**: Creating relationships through regular communication and knowledge-sharing.\n    \n* **Constructive Feedback**: Using frameworks like non-violent communication for respectful and effective feedback.\n    \n* **Addressing Uncomfortable Situations**: Open communication and a solution-focused approach to handling workplace discomfort.\n    \n\n#### **Self-Advocacy & Community Building:**\n\n* **Self-Promotion**: Sharing both achievements and failures as a means to advocate for oneself and promote team growth.\n    \n* **Sharing Knowledge**: Viewing self-promotion as an opportunity to share valuable insights with others.\n    \n* **Community Building**: Being part of a community helps reduce isolation and provides mutual support in professional settings.\n    \n\n## Ep 15 & 16: Joanna\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1733904649058/058e9fb1-2163-4f02-8bb7-e51be7855672.png align=\"center\")\n\n* **Tailor Your Resume**: Customize your resume for each job application, keeping it concise and focused on key skills and experiences.\n    \n* **Cultural Differences**: Be aware of cultural variations in recruitment processes, with quicker decision-making in the US versus more drawn-out processes in Singapore.\n    \n* **Networking**: Attend events to build personal connections with recruiters and avoid aggressive approaches.\n    \n* **Technical vs Non-Technical Roles**: Recruitment processes differ for technical and non-technical roles.\n    \n* **Interviewing Styles**: Adapt your interview style to the expectations of the recruiter and cultural norms.\n    \n* **Effective Communication**: Strong communication and presentation skills are essential to stand out to recruiters.\n    \n\n## Ep 17 & 20: Andrew\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1733904555936/0797da7b-0230-43fa-90a5-ba0186027f85.png align=\"center\")\n\n#### **Career & Personal Growth**\n\n* **AI's Impact**: Human intervention and customization will remain essential despite AI's influence on software development.\n    \n* **Real-World Experience**: Hands-on experience through internships and projects is vital for growth.\n    \n* **Effective Communication**: Clear communication with teams is crucial for success in software engineering.\n    \n* **Finding Passion**: Identify personal interests within the field to stay motivated and focused.\n    \n* **Energy Management**: Managing energy helps maintain productivity and avoid burnout.\n    \n* **Mentorship Balance**: Balance mentoring junior engineers with giving them space to solve problems independently.\n    \n\n#### **Work-Life Balance & Parenting**\n\n* **Balancing Work & Fatherhood**: Time management and adaptability are key to balancing work and childcare.\n    \n* **Technology for Support**: Tools like baby monitor apps streamline parenting tasks and support work-life balance.\n    \n* **Equal Parental Involvement**: Equal involvement from both parents ensures shared responsibility in childcare.\n    \n* **Communication & Delegation**: Clear communication with partners enables effective task delegation and balanced responsibilities.\n    \n\n#### **Teamwork & Collaboration**\n\n* **Parallels to Software Engineering**: Teamwork and collaboration in parenting mirror the skills necessary for success in software development.\n    \n* **Adaptation & Growth**: Adapting to new routines and growing together as a team is essential both in parenting and professional environments.\n    \n\n## Ep 18 & 21: Martin\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1733904432931/f501dbdb-db57-41b5-957c-fbe30f96dd0e.png align=\"center\")\n\n#### Open Source and Community Engagement:\n\n* **Open Source Concept**: Open source is about freely sharing software code to foster collaboration and innovation.\n    \n* **Benefits of Open Source**: Contributing to open source enhances the tech ecosystem and promotes community involvement.\n    \n* **Challenges of Maintaining Projects**: Maintaining open source projects offers both rewarding contributions and the risk of burnout.\n    \n* **Tech Meetups & Engagement**: Organizing tech meetups is challenging but essential for continuous learning, building relationships, and fostering community engagement.\n    \n* **Engagement and Learning**: Staying connected with the tech community and prioritizing ongoing learning is critical for growth.\n    \n* **Future Plans**: The creators plan to develop a website for their tech show to enhance community engagement.\n    \n\n#### Financial Freedom and Bitcoin Investment:\n\n* **Dollar-Cost Averaging**: Consistent Bitcoin purchases through dollar-cost averaging resulted in significant returns (10x) over four years.\n    \n* **Long-Term Planning & Financial Discipline**: Patience, long-term planning, and disciplined saving and budgeting led to Martin's financial independence.\n    \n* **Psychological Mindset & Self-Awareness**: Maintaining a strong mindset, being self-aware, and staying disciplined are crucial when navigating volatile markets like Bitcoin.\n    \n* **Understanding Bitcoin & Tools for Success**: A deep understanding of Bitcoin fundamentals and using budgeting tools like You Need a Budget helped in making informed investment decisions and managing finances effectively.\n    \n\n## Conclusion\n\nWe are deeply grateful to each guest for taking the time out of their busy schedules to share their wisdom and stories with us. From navigating professional challenges to offering practical advice on mentorship, parenting, and financial independence, their contributions have been both inspiring and enriching. As we look ahead, these conversations encourage us to keep learning, supporting one another, and building inclusive, thriving communities in tech and beyond 🍻\n\nWe also want to thank our followers and subscribers for your invaluable feedback and continued support throughout the year. Your engagement motivates us to keep creating meaningful content. Stay tuned for more bytes and banter from ragTech in 2025—we’re excited to bring you even more inspiring conversations and insights! 🥳"
  },
  "tags": [
    {
      "name": "review",
      "slug": "review"
    },
    {
      "name": "podcast",
      "slug": "podcast"
    },
    {
      "name": "technology",
      "slug": "technology"
    },
    {
      "name": "community",
      "slug": "community"
    },
    {
      "name": "Career",
      "slug": "career"
    }
  ],
  "_archived": {
    "source": "hashnode",
    "archived_date": "2026-01-20T03:54:58.980Z",
    "original_url": "https://blog.ragtechdev.com/key-insights-from-2024-learnings-from-our-podcast-guests"
  }
}