{
  "id": "693fb1302e8d528345afa17e",
  "title": "Leading Through Systems: What The Fifth Discipline Taught Me About People, Processes, and Code",
  "brief": "💡\nThis article is a republish from Articles by Victoria\n\n\nOne of my readers recently recommended Peter Senge’s The Fifth Discipline because they knew I was curious about systems thinking, beyond the context of code and more on the unpredictable syst...",
  "slug": "leading-through-systems-what-the-fifth-discipline-taught-me-about-people-processes-and-code",
  "coverImage": {
    "url": "https://cdn.hashnode.com/res/hashnode/image/upload/v1765781752062/65e9f6c1-337c-4702-940e-2e139968c490.webp"
  },
  "publishedAt": "2025-12-15T06:56:48.758Z",
  "readTimeInMinutes": 8,
  "author": {
    "name": "Victoria Lo",
    "profilePicture": "https://cdn.hashnode.com/res/hashnode/image/upload/v1767713322721/dfbc8b12-1ce5-4b0a-9966-981c90caec33.jpeg?w=500&h=500&fit=crop&crop=entropy&auto=compress,format&format=webp"
  },
  "content": {
    "html": "<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">💡</div>\n<div data-node-type=\"callout-text\">This article is a republish from <a target=\"_self\" href=\"https://lo-victoria.com/leading-through-systems-what-the-fifth-discipline-taught-me-about-people-processes-and-code\">Articles by Victoria</a></div>\n</div>\n\n<p>One of my readers recently recommended Peter Senge’s The Fifth Discipline because they knew I was curious about systems thinking, beyond the context of code and more on the unpredictable systems that are humans.</p>\n<p>For those who are reading one of my articles for the first time, outside technical articles, I sometimes explore on topics such as psychology, organisational behaviour and leadership so this book is a beautiful blend of all these topics.</p>\n<p>And I have to say: it did not disappoint.</p>\n<p>For those who haven’t read it, the book is about how organizations can become “learning organizations”. In particular, ones that can adapt, innovate, and thrive in complex environments.</p>\n<p>To achieve this, Senge identifies there are five disciplines the organization has to adopt: personal mastery, mental models, shared vision, team learning, and systems thinking (AKA the “fifth discipline”).</p>\n<p>If you’re interested in leadership, systems, or just understanding how people and processes interact, I highly recommend giving it a read!</p>\n<p><img src=\"https://bci.kinokuniya.com/jsp/images/book-img/97819/97819052/9781905211203.JPG\" alt=\"The Fifth Discipline: The art and practice of the by Peter M Senge\" class=\"image--center mx-auto\" /></p>\n<p>If you don’t have time to read, here's my summary and key takeaways.</p>\n<h2 id=\"heading-the-five-disciplines\">The Five Disciplines</h2>\n<p>Here’s a quick run-through of what each discipline is about:</p>\n<h3 id=\"heading-1-personal-mastery\">1) Personal Mastery</h3>\n<p>TLDR: Self improvement. Continuously clarifying and deepening your personal vision, focusing on learning, and being aware of your own assumptions and motivations. It’s about being proactive rather than reactive.</p>\n<h3 id=\"heading-2-mental-models\">2) Mental Models</h3>\n<p>The assumptions, beliefs, and generalizations we hold that shape how we see the world. By surfacing and challenging these, we can improve decision-making and collaboration.</p>\n<blockquote>\n<p>I recommend reading up on cognitive functions to supplement. Future article on cognitive functions coming soon :)</p>\n</blockquote>\n<h3 id=\"heading-3-shared-vision\">3) Shared Vision</h3>\n<p>Creating a common goal that inspires commitment rather than compliance. When people feel connected to a shared purpose, they work together more effectively.</p>\n<h3 id=\"heading-4-team-learning\">4) Team Learning</h3>\n<p>Learning as a team, not just as individuals. This involves dialogue, open communication, and the ability to suspend assumptions to truly understand others.</p>\n<h3 id=\"heading-5-systems-thinking\">5) Systems Thinking</h3>\n<p>The discipline that integrates the other four, helping us see the whole picture, recognize patterns, and understand cause-and-effect over time rather than just reacting to events.</p>\n<p><img src=\"https://minio.scielo.br/documentstore/1984-0446/hy6pcdrNj5k5g9KsLHMt5CF/e921b4016e6f4fa61406854a27d79720cbbef715.png\" alt=\"Source: https://minio.scielo.br/documentstore/1984-0446/hy6pcdrNj5k5g9KsLHMt5CF/e921b4016e6f4fa61406854a27d79720cbbef715.png\" /></p>\n<h2 id=\"heading-case-study-seeing-systems-in-action-at-wds\">Case Study: Seeing Systems in Action at WDS</h2>\n<p>At WomenDevsSG, I’ve had the privilege of leading initiatives for the community with my volunteers. And I realized that running a community is like running a small, dynamic system: people join, people leave, priorities shift, and unexpected feedback loops emerge all the time.</p>\n<p>Senge’s systems thinking hit me in a personal way: the idea that events are just snapshots, but patterns tell the real story. In WDS, we noticed a pattern: some volunteers burned out quickly while others thrived. The active ones were taking on significantly more work while newly onboarded ones seem lost on what to do often.</p>\n<p>On the surface, it seemed circumstantial but looking deeper, I saw the system at work. The most active volunteers are clear on their tasks, asked for help comfortably in the group and understand what they want to contribute in. But when it comes to new volunteers all these are onboarding gaps that causes confusion and lack of commitment.</p>\n<p>Applying this insight, we introduced small but deliberate change: a volunteer management bot, brilliantly contributed and initiated by our Partnership Lead and my co-host at <a target=\"_blank\" href=\"https://www.youtube.com/@ragTechDev\">ragTech</a>, <a class=\"user-mention\" href=\"https://hashnode.com/@natashaannn\">Natasha Ann</a> .</p>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1763394285884/68adca3a-e91f-4933-846a-9ac99ee96e59.png\" alt class=\"image--center mx-auto\" /></p>\n<p>The result wasn’t dramatic overnight, but gradually, the community became more resilient. It provides volunteers with a clear understanding of their tasks and the level of commitment we expect from them. I saw first hand that systems thinking gave us the patience and perspective to design processes that empower people instead of controlling them.</p>\n<h2 id=\"heading-case-study-2-systems-thinking-as-a-solutions-engineer-lead\">Case Study 2: Systems Thinking as a Solutions Engineer Lead</h2>\n<p>In my day job, the “systems” I encountered are both technical and human. Automating workflows, aligning with stakeholders, translating non-tech to tech (and vice versa) or designing solutions is rewarding, but the hard part is that people are embedded in those systems. That said, the root of problems is people, <strong>but problems are opportunities</strong>, not obstacles.</p>\n<p>Senge’s principles, especially mental models and shared vision, help me navigate this complexity. One of the hardest problems I’ve observed recently is a person’s resistance to change.</p>\n<p>Developers might push back because they don’t see the value in a new workflow; sales might resist because it adds steps or introduce a new unfamiliar change to their routine. If I only focus on communicating my idea as the technical solution, no one would budge. But if I approach it as a system by considering incentives, assumptions, and feedback loops, I am able to redesign the process and communicate it in a way that makes sense to everyone.</p>\n<p>For example, I once worked on an implementation where the client’s support team kept flagging our system as “too complex,” while their sales team was frustrated that automation rules weren’t triggering fast enough. On the surface, it looked like a configuration problem. But when I stepped back and looked at it as a system, I realized the issue wasn’t the software, it was the incentives.</p>\n<p>The support team was measured by resolution time, while sales was measured by conversion speed. Both were optimizing for their own success metrics, which were unintentionally pulling the system in opposite directions.</p>\n<p>By mapping those feedback loops and understanding their assumptions, I could redesign the workflow so that both teams were aligned on shared outcomes. Once everyone saw how their part fit into the larger process, resistance faded. What started as frustration became collaboration.</p>\n<p><img src=\"https://www.researchgate.net/publication/362138883/figure/fig3/AS:1179971112443931@1658338444945/The-Fifth-discipline-Senge-1994.ppm\" alt=\"3.: The Fifth discipline (Senge, 1994) | Download Scientific Diagram\" class=\"image--center mx-auto\" /></p>\n<p>It’s a bit like coding: a function doesn’t just have to work; it has to integrate cleanly with the rest of the system. Systems thinking lets me “debug” the human side of the system, not just the technical side.</p>\n<h2 id=\"heading-senges-11-laws-of-systems-thinking\">Senge’s 11 Laws of Systems Thinking</h2>\n<p>Senge also outlines 11 “laws” that help make sense of systems. Here’s a quick TLDR:</p>\n<p>1. Today’s problems come from yesterday’s solutions. Quick fixes can create long-term issues.</p>\n<p>2. The harder you push, the harder the system pushes back. Interventions can trigger resistance.</p>\n<p>3. Behavior grows better before it grows worse. Improvements may hide underlying problems temporarily.</p>\n<p>4. The easy way out usually leads back in. Short-term fixes rarely solve the root cause.</p>\n<p>5. The cure can be worse than the disease. Well-intentioned solutions can create unintended consequences.</p>\n<p>6. Faster is slower. Trying to speed up processes can introduce delays in the long run.</p>\n<p>7. Cause and effect are not closely related in time and space. Impacts may appear far from the source.</p>\n<p>8. Small changes can produce big results—but the areas of highest leverage are often least obvious. Focus on where interventions matter most.</p>\n<p>9. You can have your cake and eat it too—but not all at once. Some trade-offs are unavoidable.</p>\n<p>10. Dividing an elephant in half does not produce two small elephants. Treating systems as isolated parts ignores interactions.</p>\n<p>11. There is no blame. Problems are systemic, not personal.</p>\n<p>Keeping these in mind makes it easier to step back and see patterns instead of reacting to every single symptom in both my personal and work life.</p>\n<h2 id=\"heading-what-we-as-developers-can-take-away\">What We as Developers Can Take Away</h2>\n<p>We often think in functions, classes, and workflows, but systems thinking teaches us to zoom out. Here’s what I think is most relevant:</p>\n<p>1. Code is part of a larger system: Your well-written function is useless if it doesn’t play nicely with other components or the people using it.</p>\n<p>2. Observe patterns, not just events: A one-off bug is frustrating; recurring issues point to systemic flaws.</p>\n<p>3. Design for humans: Systems are not only technical but also social and human. Document well (think about how others can easily use it without your supervision), communicate clearly, and make processes predictable.</p>\n<p>4. Leverage feedback loops: Automated tests, monitoring dashboards, and team retrospectives are all forms of feedback that keep the system healthy.</p>\n<p>5. Small changes matter: Improving onboarding, adding clear documentation, or introducing a simple notification can have a bigger impact than a complex refactor.</p>\n<h2 id=\"heading-bridging-tech-through-a-new-game\">Bridging Tech Through a New Game</h2>\n<p>As a segue, that same mindset has also shaped how we think about projects at <a target=\"_blank\" href=\"https://ragtechdev.com/\"><strong>ragTech</strong></a>. When we started designing <strong>Techie Taboo</strong>, our goal wasn’t just to make another game about technology. We wanted to design a <em>system</em> for learning, one that helps people connect, question assumptions, and understand how technology really works in everyday life.</p>\n<p>Because accessibility in tech isn’t just about simplifying concepts. It’s about building systems of understanding that people can trust and enjoy engaging with.</p>\n<p>Check out how to play the game: <a target=\"_blank\" href=\"https://www.instagram.com/reel/DRQJq8CCXrI\">https://www.instagram.com/reel/DRQJq8CCXrI</a></p>\n<p><strong>Techie Taboo</strong> is our small experiment in that direction. A card game where curiosity, laughter, and collective learning can coexist! Our <strong>waitlist just opened</strong>!</p>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1765069672254/c4f00da7-d45f-4b0f-950f-b96a4b1c083b.png\" alt class=\"image--center mx-auto\" /></p>\n<p>By joining, you can be <strong>among the very first</strong> to explore the game, give us feedback (as mentioned about feedback loops) and experience this new approach to learning tech, and help shape the way we make technology more accessible for everyone! Do check it out if you’re interested!</p>\n<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">💡</div>\n<div data-node-type=\"callout-text\">Join the waitlist here: <a target=\"_self\" href=\"https://ragtechdev.com/techie-taboo\">https://ragtechdev.com/techie-taboo</a></div>\n</div>\n\n<h2 id=\"heading-my-personal-takeaways\">My Personal Takeaways</h2>\n<p>The Fifth Discipline reinforced something I’ve been discovering through both WDS and work: leadership and engineering share a core skill that designing systems that people can trust and thrive in. The best leaders I know aren’t just “people managers”; they’re also system architects.</p>\n<p>Because they anticipate problems, understand feedback loops, and design processes that survive both growth and change.</p>\n<p>For me, the biggest insight is simple but powerful: <strong>if you focus only on tasks, you’ll fix symptoms. If you focus on systems, you’ll create lasting impact</strong>. Whether it’s managing volunteers or leading a technical team, the principle is the same. Build a system that works and people will naturally adopt and follow.</p>\n<p>If you haven’t read it yet, I encourage you to pick up The Fifth Discipline. Even skimming it with a “systems in leadership” lens can shift the way you approach both teams and technology!</p>\n<p>Thanks for reading till the end! Hope this article was a good read! See you in the next article! Cheers!</p>\n<h3 id=\"heading-lets-connect\"><strong>Let's Connect!</strong></h3>\n<ul>\n<li><p><a target=\"_blank\" href=\"https://twitter.com/lo_victoria2666\"><strong>Twitter</strong></a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://www.linkedin.com/in/victoria2666/\"><strong>LinkedIn</strong></a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://github.com/victoria-lo\"><strong>GitHub</strong></a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://ragtechdev.com/\">ragTech</a></p>\n</li>\n<li><p><a target=\"_blank\" href=\"https://linktr.ee/womendevssg\">WomenDevsSG links</a></p>\n</li>\n</ul>\n<h3 id=\"heading-image-credits\">Image credits</h3>\n<ul>\n<li><a target=\"_blank\" href=\"https://minio.scielo.br/documentstore/1984-0446/hy6pcdrNj5k5g9KsLHMt5CF/e921b4016e6f4fa61406854a27d79720cbbef715.png\">5 Disciplines Diagram</a></li>\n</ul>\n",
    "markdown": "<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">💡</div>\n<div data-node-type=\"callout-text\">This article is a republish from <a target=\"_self\" rel=\"noopener noreferrer nofollow\" href=\"https://lo-victoria.com/leading-through-systems-what-the-fifth-discipline-taught-me-about-people-processes-and-code\" style=\"pointer-events: none\">Articles by Victoria</a></div>\n</div>\n\nOne of my readers recently recommended Peter Senge’s The Fifth Discipline because they knew I was curious about systems thinking, beyond the context of code and more on the unpredictable systems that are humans.\n\nFor those who are reading one of my articles for the first time, outside technical articles, I sometimes explore on topics such as psychology, organisational behaviour and leadership so this book is a beautiful blend of all these topics.\n\nAnd I have to say: it did not disappoint.\n\nFor those who haven’t read it, the book is about how organizations can become “learning organizations”. In particular, ones that can adapt, innovate, and thrive in complex environments.\n\nTo achieve this, Senge identifies there are five disciplines the organization has to adopt: personal mastery, mental models, shared vision, team learning, and systems thinking (AKA the “fifth discipline”).\n\nIf you’re interested in leadership, systems, or just understanding how people and processes interact, I highly recommend giving it a read!\n\n![The Fifth Discipline: The art and practice of the by Peter M Senge](https://bci.kinokuniya.com/jsp/images/book-img/97819/97819052/9781905211203.JPG align=\"center\")\n\nIf you don’t have time to read, here's my summary and key takeaways.\n\n## The Five Disciplines\n\nHere’s a quick run-through of what each discipline is about:\n\n### 1) Personal Mastery\n\nTLDR: Self improvement. Continuously clarifying and deepening your personal vision, focusing on learning, and being aware of your own assumptions and motivations. It’s about being proactive rather than reactive.\n\n### 2) Mental Models\n\nThe assumptions, beliefs, and generalizations we hold that shape how we see the world. By surfacing and challenging these, we can improve decision-making and collaboration.\n\n> I recommend reading up on cognitive functions to supplement. Future article on cognitive functions coming soon :)\n\n### 3) Shared Vision\n\nCreating a common goal that inspires commitment rather than compliance. When people feel connected to a shared purpose, they work together more effectively.\n\n### 4) Team Learning\n\nLearning as a team, not just as individuals. This involves dialogue, open communication, and the ability to suspend assumptions to truly understand others.\n\n### 5) Systems Thinking\n\nThe discipline that integrates the other four, helping us see the whole picture, recognize patterns, and understand cause-and-effect over time rather than just reacting to events.\n\n![Source: https://minio.scielo.br/documentstore/1984-0446/hy6pcdrNj5k5g9KsLHMt5CF/e921b4016e6f4fa61406854a27d79720cbbef715.png](https://minio.scielo.br/documentstore/1984-0446/hy6pcdrNj5k5g9KsLHMt5CF/e921b4016e6f4fa61406854a27d79720cbbef715.png align=\"left\")\n\n## Case Study: Seeing Systems in Action at WDS\n\nAt WomenDevsSG, I’ve had the privilege of leading initiatives for the community with my volunteers. And I realized that running a community is like running a small, dynamic system: people join, people leave, priorities shift, and unexpected feedback loops emerge all the time.\n\nSenge’s systems thinking hit me in a personal way: the idea that events are just snapshots, but patterns tell the real story. In WDS, we noticed a pattern: some volunteers burned out quickly while others thrived. The active ones were taking on significantly more work while newly onboarded ones seem lost on what to do often.\n\nOn the surface, it seemed circumstantial but looking deeper, I saw the system at work. The most active volunteers are clear on their tasks, asked for help comfortably in the group and understand what they want to contribute in. But when it comes to new volunteers all these are onboarding gaps that causes confusion and lack of commitment.\n\nApplying this insight, we introduced small but deliberate change: a volunteer management bot, brilliantly contributed and initiated by our Partnership Lead and my co-host at [ragTech](https://www.youtube.com/@ragTechDev), @[Natasha Ann](@natashaannn) .\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1763394285884/68adca3a-e91f-4933-846a-9ac99ee96e59.png align=\"center\")\n\nThe result wasn’t dramatic overnight, but gradually, the community became more resilient. It provides volunteers with a clear understanding of their tasks and the level of commitment we expect from them. I saw first hand that systems thinking gave us the patience and perspective to design processes that empower people instead of controlling them.\n\n## Case Study 2: Systems Thinking as a Solutions Engineer Lead\n\nIn my day job, the “systems” I encountered are both technical and human. Automating workflows, aligning with stakeholders, translating non-tech to tech (and vice versa) or designing solutions is rewarding, but the hard part is that people are embedded in those systems. That said, the root of problems is people, **but problems are opportunities**, not obstacles.\n\nSenge’s principles, especially mental models and shared vision, help me navigate this complexity. One of the hardest problems I’ve observed recently is a person’s resistance to change.\n\nDevelopers might push back because they don’t see the value in a new workflow; sales might resist because it adds steps or introduce a new unfamiliar change to their routine. If I only focus on communicating my idea as the technical solution, no one would budge. But if I approach it as a system by considering incentives, assumptions, and feedback loops, I am able to redesign the process and communicate it in a way that makes sense to everyone.\n\nFor example, I once worked on an implementation where the client’s support team kept flagging our system as “too complex,” while their sales team was frustrated that automation rules weren’t triggering fast enough. On the surface, it looked like a configuration problem. But when I stepped back and looked at it as a system, I realized the issue wasn’t the software, it was the incentives.\n\nThe support team was measured by resolution time, while sales was measured by conversion speed. Both were optimizing for their own success metrics, which were unintentionally pulling the system in opposite directions.\n\nBy mapping those feedback loops and understanding their assumptions, I could redesign the workflow so that both teams were aligned on shared outcomes. Once everyone saw how their part fit into the larger process, resistance faded. What started as frustration became collaboration.\n\n![3.: The Fifth discipline (Senge, 1994) | Download Scientific Diagram](https://www.researchgate.net/publication/362138883/figure/fig3/AS:1179971112443931@1658338444945/The-Fifth-discipline-Senge-1994.ppm align=\"center\")\n\nIt’s a bit like coding: a function doesn’t just have to work; it has to integrate cleanly with the rest of the system. Systems thinking lets me “debug” the human side of the system, not just the technical side.\n\n## Senge’s 11 Laws of Systems Thinking\n\nSenge also outlines 11 “laws” that help make sense of systems. Here’s a quick TLDR:\n\n1\\. Today’s problems come from yesterday’s solutions. Quick fixes can create long-term issues.\n\n2\\. The harder you push, the harder the system pushes back. Interventions can trigger resistance.\n\n3\\. Behavior grows better before it grows worse. Improvements may hide underlying problems temporarily.\n\n4\\. The easy way out usually leads back in. Short-term fixes rarely solve the root cause.\n\n5\\. The cure can be worse than the disease. Well-intentioned solutions can create unintended consequences.\n\n6\\. Faster is slower. Trying to speed up processes can introduce delays in the long run.\n\n7\\. Cause and effect are not closely related in time and space. Impacts may appear far from the source.\n\n8\\. Small changes can produce big results—but the areas of highest leverage are often least obvious. Focus on where interventions matter most.\n\n9\\. You can have your cake and eat it too—but not all at once. Some trade-offs are unavoidable.\n\n10\\. Dividing an elephant in half does not produce two small elephants. Treating systems as isolated parts ignores interactions.\n\n11\\. There is no blame. Problems are systemic, not personal.\n\nKeeping these in mind makes it easier to step back and see patterns instead of reacting to every single symptom in both my personal and work life.\n\n## What We as Developers Can Take Away\n\nWe often think in functions, classes, and workflows, but systems thinking teaches us to zoom out. Here’s what I think is most relevant:\n\n1\\. Code is part of a larger system: Your well-written function is useless if it doesn’t play nicely with other components or the people using it.\n\n2\\. Observe patterns, not just events: A one-off bug is frustrating; recurring issues point to systemic flaws.\n\n3\\. Design for humans: Systems are not only technical but also social and human. Document well (think about how others can easily use it without your supervision), communicate clearly, and make processes predictable.\n\n4\\. Leverage feedback loops: Automated tests, monitoring dashboards, and team retrospectives are all forms of feedback that keep the system healthy.\n\n5\\. Small changes matter: Improving onboarding, adding clear documentation, or introducing a simple notification can have a bigger impact than a complex refactor.\n\n## Bridging Tech Through a New Game\n\nAs a segue, that same mindset has also shaped how we think about projects at [**ragTech**](https://ragtechdev.com/). When we started designing **Techie Taboo**, our goal wasn’t just to make another game about technology. We wanted to design a *system* for learning, one that helps people connect, question assumptions, and understand how technology really works in everyday life.\n\nBecause accessibility in tech isn’t just about simplifying concepts. It’s about building systems of understanding that people can trust and enjoy engaging with.\n\nCheck out how to play the game: [https://www.instagram.com/reel/DRQJq8CCXrI](https://www.instagram.com/reel/DRQJq8CCXrI)\n\n**Techie Taboo** is our small experiment in that direction. A card game where curiosity, laughter, and collective learning can coexist! Our **waitlist just opened**!\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1765069672254/c4f00da7-d45f-4b0f-950f-b96a4b1c083b.png align=\"center\")\n\nBy joining, you can be **among the very first** to explore the game, give us feedback (as mentioned about feedback loops) and experience this new approach to learning tech, and help shape the way we make technology more accessible for everyone! Do check it out if you’re interested!\n\n<div data-node-type=\"callout\">\n<div data-node-type=\"callout-emoji\">💡</div>\n<div data-node-type=\"callout-text\">Join the waitlist here: <a target=\"_self\" rel=\"noopener noreferrer nofollow\" href=\"https://ragtechdev.com/techie-taboo\" style=\"pointer-events: none\">https://ragtechdev.com/techie-taboo</a></div>\n</div>\n\n## My Personal Takeaways\n\nThe Fifth Discipline reinforced something I’ve been discovering through both WDS and work: leadership and engineering share a core skill that designing systems that people can trust and thrive in. The best leaders I know aren’t just “people managers”; they’re also system architects.\n\nBecause they anticipate problems, understand feedback loops, and design processes that survive both growth and change.\n\nFor me, the biggest insight is simple but powerful: **if you focus only on tasks, you’ll fix symptoms. If you focus on systems, you’ll create lasting impact**. Whether it’s managing volunteers or leading a technical team, the principle is the same. Build a system that works and people will naturally adopt and follow.\n\nIf you haven’t read it yet, I encourage you to pick up The Fifth Discipline. Even skimming it with a “systems in leadership” lens can shift the way you approach both teams and technology!\n\nThanks for reading till the end! Hope this article was a good read! See you in the next article! Cheers!\n\n### **Let's Connect!**\n\n* [**Twitter**](https://twitter.com/lo_victoria2666)\n    \n* [**LinkedIn**](https://www.linkedin.com/in/victoria2666/)\n    \n* [**GitHub**](https://github.com/victoria-lo)\n    \n* [ragTech](https://ragtechdev.com/)\n    \n* [WomenDevsSG links](https://linktr.ee/womendevssg)\n    \n\n### Image credits\n\n* [5 Disciplines Diagram](https://minio.scielo.br/documentstore/1984-0446/hy6pcdrNj5k5g9KsLHMt5CF/e921b4016e6f4fa61406854a27d79720cbbef715.png)"
  },
  "tags": [
    {
      "name": "books",
      "slug": "books"
    },
    {
      "name": "review",
      "slug": "review"
    },
    {
      "name": "book recommendations",
      "slug": "book-recommendations"
    },
    {
      "name": "System Design",
      "slug": "system-design"
    },
    {
      "name": "leadership",
      "slug": "leadership"
    },
    {
      "name": "personal development",
      "slug": "personal-development"
    },
    {
      "name": "Career",
      "slug": "career"
    },
    {
      "name": "Developer",
      "slug": "developer"
    }
  ],
  "_archived": {
    "source": "hashnode",
    "archived_date": "2026-01-20T03:54:58.980Z",
    "original_url": "https://blog.ragtechdev.com/leading-through-systems-what-the-fifth-discipline-taught-me-about-people-processes-and-code"
  }
}